---
type: IFailuresPreprocessor
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# IFailuresPreprocessor

`Autodesk.Revit.DB.IFailuresPreprocessor` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | PreprocessFailures | 2011 | `FailureProcessingResult PreprocessFailures ( FailuresAccessor failuresAccessor )` |